{
    "description": "Five friends have been attending a weekly jewelry-making class led by renowned local artisan Liana Glass, who is known for swapping gemstones for coffee at the weekend markets! The group have just completed their final projects. Each made a different type of jewelry, featuring a unique choice of gemstone. As a finishing touch, Liana also challenged them to come up with collection names to showcase their work. Can you match each participant with their collection name, the type of jewelry they created, and the gemstone they used?\nThe permissible items are: \nCollection: ['\"Gemini Nights\"', '\"Miramare\"', '\"Wild Lunar\"', '\"Arcana\"', '\"Little Loops\"']\nType: ['Bracelet', 'Ring', 'Anklet', 'Earrings', 'Pendant']\nStone: ['Moonstone', 'Amethyst', 'Bracelet', 'Citrine', 'Garnet', 'Peridot']\nName: ['Amethyst', 'Yvette', 'Elliot', 'Melanie']",
    "clues": [
        {
            "id": 1,
            "text": "The five friends are the one who created the earrings, the one who used moonstone, the one who made a pendant, the one who named their collection \"Gemini Nights\", and Elliot."
        },
        {
            "id": 2,
            "text": "The piece made for the \"Arcana\" collection (which is not a ring) features either moonstone or garnet."
        },
        {
            "id": 3,
            "text": "When tasked with the final project, Melanie struggled to choose between making a pendant or an anklet, but she was only able to pick one."
        },
        {
            "id": 4,
            "text": "Of the earrings and the pendant, one features citrine and the other uses raw amethyst."
        },
        {
            "id": 5,
            "text": "There isn't any amethyst to be found in the piece attributed to the \"Gemini Nights\" collection."
        },
        {
            "id": 6,
            "text": "One of the friends crafted a thin silver chained bracelet featuring a small green peridot stone."
        },
        {
            "id": 7,
            "text": "The decision to use citrine as a gemstone was an easy one for Cameron, who brought in a few polished pieces from home."
        },
        {
            "id": 8,
            "text": "Liana was impressed with the bracelet made by Yvette, which will be featured in an article about the class in the local community newsletter."
        },
        {
            "id": 9,
            "text": "Letitia is not a fan of amethyst, and chose a different stone for her creation - which wasn't a ring. The person who did make the ring didn't name their collection \"Wild Lunar\"."
        },
        {
            "id": 10,
            "text": "The proud creator of the pair of gemstone earrings named their collection \"Little Loops\", inspired by... well, the earrings."
        }
    ]
}