{
    "description": "Pieter's first task of his new job at PR firm \"Scandaless\" is to organise his supervisors most commonly used passwords. First he needs to reset them all in case his predecessor is a little bitter (also simply because she came up with terrible passwords), then he needs to record them in a secure location (like a logic puzzle!). From the clues provided, can you determine the old password and the new password for each type of application?\nThe permissible items are: \nOld Password: ['bingo', '123abc', 'password3', 'kittycats', 'thisisdumb', 'password2']\nNew Password: ['tEp@x2&N8fdayS', 'Vu7u$P@j6eDr', 'p13T3R@W0rk!', 'k@Tmn3qcem%$', 'bK9FByy7KtFjAm', 'p5xXNk^%GyA$']\nApplication: ['Social Media', 'Video Production', 'Client Management', 'Document Sharing', 'k@Tmn3qcem%$']",
    "clues": [
        {
            "id": 1,
            "text": "Pieter was a little amused at the use of passwords \"password2\" and \"password3\", which were the passwords used for the Client Management and the Social Media applications, but not necessarily in that order."
        },
        {
            "id": 2,
            "text": "The password \"kittycats\" was promptly changed to a more secure password, starting with a capital letter V."
        },
        {
            "id": 3,
            "text": "The two former passwords that were simply the word \"password\" followed by a number have now been changed to a more secure choice! Neither of them were changed to a password beginning with the lowercase letter \"t\"."
        },
        {
            "id": 4,
            "text": "As Pieter snickered at his predecessor's use of the password \"thisisdumb\" for the Document Sharing application, he wondered what he was getting himself into with this new job. Hopefully she was just bored that day."
        },
        {
            "id": 5,
            "text": "The new password for the Video Production application has at least one non-alphanumeric symbol in it. This is also the case for the Social Media application and the Backup Manager."
        },
        {
            "id": 6,
            "text": "Three of the unique applications are the one that had its password changed to \"bK9FByy7KtFjAm\", the one that formerly had the password \"password3\", and the Client Management application."
        },
        {
            "id": 7,
            "text": "The new password for the Document Sharing application does not have an @ symbol in it. The new password for the Backup Manager does not end with the dollar symbol ($)."
        },
        {
            "id": 8,
            "text": "Pieter employed a creative expression of his name for the Note Taking application password, but after his new supervisor was not amused he used a random password generator for the others."
        },
        {
            "id": 9,
            "text": "The Note Taking application was either the one with old password \"123abc\" or the one with new password \"tEp@x2&N8fdayS\"."
        },
        {
            "id": 10,
            "text": "Of the Social Media application and the Video Production application, one has a new password beginning with lowercase letter \"k\", and the other previously had the password \"bingo\"."
        }
    ]
}